## 第四周

In [2]:
!pip install pandas

Requirement already satisfied: pandas in d:\github\1141-ml-pandas\.venv\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in d:\github\1141-ml-pandas\.venv\lib\site-packages (from pandas) (2.3.3)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\github\1141-ml-pandas\.venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in d:\github\1141-ml-pandas\.venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in d:\github\1141-ml-pandas\.venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in d:\github\1141-ml-pandas\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [3]:
import pandas as pd

In [4]:
print(pd.__version__)

2.3.3

In [5]:
import pandas as pd
# 創建Series

# 建立紀錄成績的Series，不設定index，value是他們的分數
grades = pd.Series([60, 27, 72, 53])
print(grades)

# 建立紀錄成績的Series，index是學生名稱，value是他們的分數
grades_withindex = pd.Series(
    [60, 27, 72, 53],  #成績數值List
    index=['多拉A夢', '大雄', '小夫', '胖虎'])  #對應的學生名稱

# 輸出 Series，觀察格式與內容
print(grades_withindex)

0    60
1    27
2    72
3    53
dtype: int64
多拉A夢    60
大雄      27
小夫      72
胖虎      53
dtype: int64

In [6]:
# 建立學生資料的dictionary（字典）
data = {
    'name': ['多啦A夢', '大雄', '小夫', '胖虎'],
    'email': ['Dora@gmail.com', 'hibino@gmail.com', 'rich@gmail.com', 'goodSinger@gmail.com'],
    'grades': [60, 77, 92, 43]
}

# 使用 pd.DataFrame() 將上面的字典轉換為表格型資料（DataFrame）
df = pd.DataFrame(data)

print(df)

df_withindex = pd.DataFrame(data,index=['學生1', '學生2', '學生3', '學生4'])
print("設定index：\n",df_withindex)

df_withcolumn = pd.DataFrame(data,index=['學生1', '學生2', '學生3', '學生4'],columns=["email","name","grades"])
print("設定 column：\n",df_withcolumn)

   name                 email  grades
0  多啦A夢        Dora@gmail.com      60
1    大雄      hibino@gmail.com      77
2    小夫        rich@gmail.com      92
3    胖虎  goodSinger@gmail.com      43
設定index：
      name                 email  grades
學生1  多啦A夢        Dora@gmail.com      60
學生2    大雄      hibino@gmail.com      77
學生3    小夫        rich@gmail.com      92
學生4    胖虎  goodSinger@gmail.com      43
設定 column：
                     email  name  grades
學生1        Dora@gmail.com  多啦A夢      60
學生2      hibino@gmail.com    大雄      77
學生3        rich@gmail.com    小夫      92
學生4  goodSinger@gmail.com    胖虎      43

In [8]:
# 使用Pandas讀取資料
# 從本機讀取 CSV 檔案，若使用Colab，要先將檔案上傳後才能讀取
df = pd.read_csv('grades.csv',encoding='utf-8-sig')
df.head(3)

     姓名 性別 班級  數學  英文  國文  自然  社會
0  多拉A夢  男  A  71  58  64  73  58
1    大雄  男  A  96  84  79  66  80
2    胖虎  男  A  61  74  90  80  76

In [9]:
print(df.columns)
print(df.index)

Index(['姓名', '性別', '班級', '數學', '英文', '國文', '自然', '社會'], dtype='object')
RangeIndex(start=0, stop=30, step=1)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   姓名      30 non-null     object
 1   性別      30 non-null     object
 2   班級      30 non-null     object
 3   數學      30 non-null     int64
 4   英文      30 non-null     int64
 5   國文      30 non-null     int64
 6   自然      30 non-null     int64
 7   社會      30 non-null     int64
dtypes: int64(5), object(3)
memory usage: 2.0+ KB

In [11]:
df['英文'].head(3)

0    58
1    84
2    74
Name: 英文, dtype: int64

In [12]:
# 顯示「姓名」和「英文」欄位
df[['姓名', '英文']].head(3)

     姓名  英文
0  多拉A夢  58
1    大雄  84
2    胖虎  74

In [13]:
# 找出英文 > 90 分的學生，並只顯示「姓名」和「英文」欄位
df[df['英文'] > 90][['姓名', '英文']].head(3)

     姓名  英文
10  我愛羅  95
11   魯夫  92
12   柯南  91

In [14]:
# 將「國文」欄位轉為 NumPy 陣列
chinese_scores = df['國文'].values

# 檢查「國文」欄位原本是什麼型別（Series）
print("轉換前資料類型: ", type(df['國文']))

# 檢查轉換後的型別（NumPy array）
print("轉換後資料類型: ", type(chinese_scores))

轉換前資料類型:  <class 'pandas.core.series.Series'>
轉換後資料類型:  <class 'numpy.ndarray'>

In [15]:
# 課堂練習: 選取特定欄位

# 任務一: 選取特定欄位並存成新DataFrame(math_df)
math_df = df[['姓名', '班級', '數學']]

# 任務二: 從剛剛選出的資料中，找出數學成績低於60的學生
math_df[math_df['數學'] < 60].head(3)

     姓名 班級  數學
3    靜香  A  48
5  櫻木花道  B  50
7   三井壽  A  50

In [16]:
# 課堂練習: 選取特定欄位

# 任務三: 多條件篩選：數學 < 60 且 班級 == 'A'
## 使用 & 表示「且」的條件邏輯，每個條件要用括號包住
math_df[(math_df['數學'] < 60) & (math_df['班級'] == 'A')].head(3)

     姓名 班級  數學
3    靜香  A  48
7   三井壽  A  50
10  我愛羅  A  53

In [17]:
# 計算數學成績的平均值
print("數學平均：", df['數學'].mean())

# 計算數學成績的標準差（分散程度）
print("數學標準差：", df['數學'].std())

# 計算數學成績的最小值
print("數學最低分：", df['數學'].min())

數學平均： 71.03333333333333
數學標準差： 12.994649650538097
數學最低分： 48

In [18]:
# 查看完整統計摘要
df.describe(include='all')

,姓名,性別,班級,數學,英文,國文,自然,社會
count,30,30,30,30.000000,30.000000,30.000000,30.000000,30.000000
unique,30,2,2,NaN,NaN,NaN,NaN,NaN
top,多拉A夢,男,A,NaN,NaN,NaN,NaN,NaN
freq,1,19,17,NaN,NaN,NaN,NaN,NaN
mean,NaN,NaN,NaN,71.033333,71.100000,80.366667,72.033333,72.866667
std,NaN,NaN,NaN,12.994650,14.020551,12.696683,11.810233,11.476312
min,NaN,NaN,NaN,48.000000,40.000000,49.000000,44.000000,44.000000
25%,NaN,NaN,NaN,61.250000,61.250000,71.000000,65.250000,67.750000
50%,NaN,NaN,NaN,71.500000,71.000000,80.500000,71.500000,72.500000
75%,NaN,NaN,NaN,81.500000,81.000000,89.750000,79.250000,80.000000
max,NaN,NaN,NaN,96.000000,100.000000,100.000000,100.000000,93.000000

In [19]:
df.select_dtypes(include='number').corr()

          數學        英文        國文        自然        社會
數學  1.000000  0.095750 -0.239382 -0.156390  0.119805
英文  0.095750  1.000000  0.280276 -0.032507  0.251681
國文 -0.239382  0.280276  1.000000 -0.242233  0.206234
自然 -0.156390 -0.032507 -0.242233  1.000000 -0.438830
社會  0.119805  0.251681  0.206234 -0.438830  1.000000

In [20]:
df[['國文', '數學', '英文']].corr()

          國文        數學        英文
國文  1.000000 -0.239382  0.280276
數學 -0.239382  1.000000  0.095750
英文  0.280276  0.095750  1.000000

In [21]:
# 計算「數學」與「英文」分數的相關係數
df['數學'].corr(df['英文'])

np.float64(0.09574960964470358)

In [22]:
# 軸操作示範
# 指定科目平均(欄平均)
df[['數學', '英文', '國文']].mean(axis=0)

數學    71.033333
英文    71.100000
國文    80.366667
dtype: float64

In [23]:
# 課堂練習; 數值運算

# 任務1: 計算總分
df['英數總分'] = df['數學'] + df['英文']

# 任務2: 計算平均分數
## 法一: 將總分/科目數量
df['英數平均'] = (df['數學'] + df['英文']) / 2

# 法二: 使用mean()函數
df['英數平均'] = df[['數學', '英文']].mean(axis=1)

# 任務3: 計算加權分數
df['加權分數'] = df['數學'] * 1.5 + df['英文']

df.head(3)

     姓名 性別 班級  數學  英文  國文  自然  社會  英數總分  英數平均   加權分數
0  多拉A夢  男  A  71  58  64  73  58   129  64.5  164.5
1    大雄  男  A  96  84  79  66  80   180  90.0  228.0
2    胖虎  男  A  61  74  90  80  76   135  67.5  165.5

In [24]:
# 任務4: 顯示加權分數最高的學生姓名與分數
# 先找出加權分數的最大值
max_score = df['加權分數'].max()

# 根據最大值篩選出對應的學生（可能不只一人）
top_students = df[df['加權分數'] == max_score]

# 顯示這些學生的姓名與加權分數
top_students[['姓名', '加權分數']]

   姓名   加權分數
1  大雄  228.0

## 第五周

In [25]:
# 課堂練習: 排序

# 任務1
# 不直接將排序結果取代原始df
df_sorted1 = df.sort_values(by=['數學'], ascending=[False])
df_sorted1[['姓名', '數學', '英文']].head(3)

    姓名  數學  英文
1   大雄  96  84
9  王小明  94  61
6  出木杉  85  89

In [26]:
# 任務2
df_sorted2 = df.sort_values(by=['數學', '英文'], ascending=[False, False])
df_sorted2[['姓名', '數學', '英文']].head(3)

     姓名  數學   英文
1    大雄  96   84
9   王小明  94   61
15  張雅婷  85  100

In [27]:
# 課堂練習: 分組

# 任務1
df.groupby('班級')['數學'].mean()

# 任務2
df.groupby('班級', as_index=False)['數學'].mean()

# 任務3
print(df.groupby(['班級', '性別'])['英文'].mean())

班級  性別
A   女     67.285714
    男     72.500000
B   女     79.750000
    男     68.666667
Name: 英文, dtype: float64

In [28]:
# 任務4
print(df.groupby('班級')['數學'].agg(['mean', 'max', 'min']))

         mean  max  min
班級
A   69.529412   96   48
B   73.000000   94   50

In [29]:
# concat範例

# 建立範例 DataFrame
## A班學生資料
classA = {
    '姓名': ['胖虎', '小夫', '靜香'],
    '性別': ['男', '男', '女'],
    '班級': ['A', 'A', 'A'],
}
## B班學生資料
classB = {
    '姓名': ['大雄', '多拉A夢', '出木杉'],
    '性別': ['男', '男', '男'],
    '班級': ['B', 'B', 'B'],
}
classA_df = pd.DataFrame(classA)
classB_df = pd.DataFrame(classB)

# 垂直合併，重設索引
df_concat = pd.concat([classA_df, classB_df], ignore_index=True)
print(df_concat)

     姓名 性別 班級
0    胖虎  男  A
1    小夫  男  A
2    靜香  女  A
3    大雄  男  B
4  多拉A夢  男  B
5   出木杉  男  B

In [30]:
# merge範例
# 建立範例 DataFrame
## 學生基本資料表
info_data = {
    '學號': ['S001', 'S002', 'S003'],
    '姓名': ['胖虎', '小夫', '靜香'],
    '性別': ['男', '男', '女']
}

## 學生成績表
score_data = {
    '學號': ['S001', 'S002', 'S003'],
    '科目': ['數學', '數學', '數學'],
    '分數': [95, 87, 88]
}

info_df = pd.DataFrame(info_data)
score_df = pd.DataFrame(score_data)

# 使用 merge 合併兩表
merged = pd.merge(info_df, score_df, on='學號')
merged.head()

     學號  姓名 性別  科目  分數
0  S001  胖虎  男  數學  95
1  S002  小夫  男  數學  87
2  S003  靜香  女  數學  88

In [31]:
# join範例

# 學生基本資料表：將「姓名」作為欄位，學號作為索引
info = {
    '姓名': ['胖虎', '小夫', '靜香'],
    '性別': ['男', '男', '女'],
    '年齡': [15, 14, 15]
}
info_df = pd.DataFrame(info, index=['S001', 'S002', 'S003'])

# 學生成績表：也以學號為索引
score = {
    '科目': ['數學', '數學', '數學'],
    '分數': [95, 87, 88]
}
score_df = pd.DataFrame(score, index=['S001', 'S002', 'S003'])

# 使用 join 合併（根據學號索引）
result = info_df.join(score_df)
print(result)

      姓名 性別  年齡  科目  分數
S001  胖虎  男  15  數學  95
S002  小夫  男  14  數學  87
S003  靜香  女  15  數學  88

In [32]:
df[df['國文'] >= 60].head()

     姓名 性別 班級  數學  英文  國文  自然  社會  英數總分  英數平均   加權分數
0  多拉A夢  男  A  71  58  64  73  58   129  64.5  164.5
1    大雄  男  A  96  84  79  66  80   180  90.0  228.0
2    胖虎  男  A  61  74  90  80  76   135  67.5  165.5
3    靜香  女  A  48  82  86  69  67   130  65.0  154.0
4    小夫  男  A  80  59  92  44  70   139  69.5  179.0

In [33]:
df.loc[df['國文'] >= 60, '數學'] = 100

In [34]:
df[df['國文'] >= 60].head()

     姓名 性別 班級   數學  英文  國文  自然  社會  英數總分  英數平均   加權分數
0  多拉A夢  男  A  100  58  64  73  58   129  64.5  164.5
1    大雄  男  A  100  84  79  66  80   180  90.0  228.0
2    胖虎  男  A  100  74  90  80  76   135  67.5  165.5
3    靜香  女  A  100  82  86  69  67   130  65.0  154.0
4    小夫  男  A  100  59  92  44  70   139  69.5  179.0

In [35]:
# 進階資料選取與修改
# 任務1
print(df.loc[df['姓名'] == '靜香', ['姓名', '數學', '英文']])

   姓名   數學  英文
3  靜香  100  82

In [36]:
# 任務2
df.loc[df['國文'] < 60, '數學'] = 100

# 任務3
df.iloc[2:5, 1:3]

  性別 班級
2  男  A
3  女  A
4  男  A

In [37]:
df.head()

     姓名 性別 班級   數學  英文  國文  自然  社會  英數總分  英數平均   加權分數
0  多拉A夢  男  A  100  58  64  73  58   129  64.5  164.5
1    大雄  男  A  100  84  79  66  80   180  90.0  228.0
2    胖虎  男  A  100  74  90  80  76   135  67.5  165.5
3    靜香  女  A  100  82  86  69  67   130  65.0  154.0
4    小夫  男  A  100  59  92  44  70   139  69.5  179.0